//Морской бой
//        Последний раздел со звездочкой: без подсказок и примеров. Матрицы идеально подходят для программирования игры
//        морской бой. Одним из этапов программирования данной игры является расстановка кораблей на игровом поле.
//        Если вы решите ряд данных задач, будьте уверены, морской бой вам по зубам.
//
//        Итак, дана матрица 10х10, состоящая из нулей.
//
//        Предположим, что она является полем для игры в морской бой. В данном поле 0 — пустая ячейка,
//        1 — корабль, либо часть корабля.
//
//        Написать функции, каждая из которых по правилам игры морской бой расставляет случайным образом:
//
//        10 однопалубных кораблей;
//        10 двухпалубных кораблей;
//        5 трехпалубных кораблей;
//        расставляет все корабли для игры в морской бой (4 однопалубных, 3 двухпалубных, 2 трехпалубных, 1 четырехпалубный).



